tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void handleDashboardPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    char value[32];

    Esp32BaseWeb::sendHeader("智能浇水");
    Esp32BaseWeb::sendPageTitle("智能浇水", "本地 12V 六路浇水控制器");
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("运行状态", runStateLabel(status.runState), status.busy ? "正在运行" : "空闲");
    snprintf(value, sizeof(value), "%u / %u", status.enabledZoneCount, kMaxZones);
    Esp32BaseWeb::sendMetric("已启用水路", value, "硬件最多 6 路");
    snprintf(value, sizeof(value), "%u / %u", status.enabledPlanCount, kMaxPlans);
    Esp32BaseWeb::sendMetric("已启用计划", value, "每日计划");
    epochToText(status.nextRunEpoch, value, sizeof(value));
    Esp32BaseWeb::sendMetric("下次运行", value, status.nextRunEpoch == 0 ? "没有已启用的计划" : "本地时间");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::beginPanel("当前概览");
    Esp32BaseWeb::sendChunk("<div class='ir-kv'>");
    Esp32BaseWeb::sendChunk("<div><b>");
    Esp32BaseWeb::sendChunk(status.configValid ? "正常" : "异常");
    Esp32BaseWeb::sendChunk("</b><span>配置状态</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().flow.pulsesPerLiter > 0 ? "已校准" : "未校准");
    Esp32BaseWeb::sendChunk("</b><span>流量计</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.pumpEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>外部自吸泵供水</span></div><div><b>");
    Esp32BaseWeb::sendChunk(ConfigStore::config().supply.lowLevelEnabled ? "启用" : "禁用");
    Esp32BaseWeb::sendChunk("</b><span>低液位保护</span></div></div>");
    if (ConfigStore::config().flow.pulsesPerLiter == 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "流量计未校准", "自动计划执行前需要先设置每升脉冲数。");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleRunPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    Esp32BaseWeb::sendHeader("运行");
    Esp32BaseWeb::sendPageTitle("运行", "手动顺序浇水和立即执行计划");
    char value[32];
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("运行状态", runStateLabel(status.runState), status.busy ? "正在运行" : "空闲");
    snprintf(value, sizeof(value), "%u", status.activeZoneId);
    Esp32BaseWeb::sendMetric("当前水路", value, status.activeZoneId == 0 ? "无" : "已打开");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(status.currentFlowMlPerMin));
    Esp32BaseWeb::sendMetric("流量 ml/min", value, "估算值");
    snprintf(value, sizeof(value), "%lu", static_cast<unsigned long>(status.currentRunVolumeMl));
    Esp32BaseWeb::sendMetric("累计水量 ml", value, "当前步骤");
    Esp32BaseWeb::endMetricGrid();
    if (status.busy) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "正在运行", runStateLabel(status.runState));
        Esp32BaseWeb::beginPanel("停止运行");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/stop'><div class='actions'><input class='danger' type='submit' value='停止浇水'></div></form>");
        Esp32BaseWeb::endPanel();
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "空闲", "当前没有正在执行的浇水任务。");
    }
    sendRunPanel();
    sendPlanNowPanel();
    Esp32BaseWeb::sendFooter();
}

void handleZonesPage() {
    Esp32BaseWeb::sendHeader("水路");
    Esp32BaseWeb::sendPageTitle("水路", "固定 6 路输出，启用实际接线的水路");
    Esp32BaseWeb::beginPanel("水路列表");

    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::sendChunk("<div class='ir-zone-list'>");
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        char buf[256];
        Esp32BaseWeb::sendChunk("<div class='ir-zone-row'><div class='ir-zone-top'><div class='ir-list-main'><b>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</b><small>时长在手动浇水或计划中设置。</small></div>");
        sendEnabledPill(zone.enabled);
        Esp32BaseWeb::sendChunk("</div><div class='ir-zone-meta'><span class='ir-pill'>");
        snprintf(buf, sizeof(buf), "%lu", static_cast<unsigned long>(zone.standardFlowMlPerMin));
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk(" ml/min 标准流量</span>");
        snprintf(buf, sizeof(buf), "<a class='btnlink info' href='/irrigation/zones/edit?id=%u'>配置</a></div></div>", zone.id);
        Esp32BaseWeb::sendChunk(buf);
    }
    Esp32BaseWeb::sendChunk("</div>");

    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleZoneEditPage() {
    uint8_t zoneId = 0;
    if (!readRequestZoneId(zoneId)) {
        Esp32BaseWeb::sendText(400, "水路编号无效");
        return;
    }
    const ZoneConfig* zone = ZoneService::find(zoneId);
    if (zone == nullptr) {
        Esp32BaseWeb::sendText(404, ZoneService::lastError());
        return;
    }

    char title[32];
    snprintf(title, sizeof(title), "水路 %u", zone->id);
    Esp32BaseWeb::sendHeader(title);
    Esp32BaseWeb::sendPageTitle(title, "配置水路基础信息");
    Esp32BaseWeb::beginPanel("水路配置");
    char buf[128];
    snprintf(buf, sizeof(buf), "<form class='ir-form' method='post' action='/irrigation/zones/save'><input type='hidden' name='id' value='%u'>", zone->id);
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::sendChunk("<div class='ir-setting-list'>");
    sendSettingToggle("启用水路", "只有启用的水路才会出现在手动浇水和计划配置中。", "enabled", zone->enabled);
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>水路名称</span><span class='ir-setting-desc'>用于页面、计划和运行历史展示。</span></div><div class='ir-control'>");
    sendTextInput("name", zone->name, sizeof(zone->name) - 1);
    Esp32BaseWeb::sendChunk("</div></div>");
    sendSettingNumber("标准流量", "用于低流量和高流量判断，校准后可以自动写入。", "ml/min", "standardFlow", zone->standardFlowMlPerMin, 0, 100000);
    Esp32BaseWeb::sendChunk("</div><div class='actions'><a class='btnlink secondary' href='/irrigation/zones'>返回列表</a><input type='submit' value='保存水路'></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendPlanStartFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>启动时间</h3><p class='ir-section-note'>同一个计划可设置多个每日启动时间，水路时长保持一致。</p><div class='ir-time-grid'>");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char timeText[8];
        minuteToText(plan.startTimes[i].minuteOfDay, timeText, sizeof(timeText));
        char buf[96];
        Esp32BaseWeb::sendChunk("<div class='ir-time-item'>");
        snprintf(buf, sizeof(buf), "se%u", i);
        sendToggleInput(buf, plan.startTimes[i].enabled);
        snprintf(buf, sizeof(buf), "<div class='ir-field'><label>时间 %u</label><input type='time' name='st%u' value='", i + 1, i);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk(timeText);
        Esp32BaseWeb::sendChunk("'></div></div>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendPlanZoneDurationFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<div class='ir-section'><h3 class='ir-section-title'>已启用水路时长</h3><p class='ir-section-note'>每个启用水路填写本计划执行时长，填 0 表示该计划跳过该水路。</p><div class='ir-zone-duration'>");
    const IrrigationConfig& config = ConfigStore::config();
    const uint32_t maxMinutes = maxZoneDurationMinutes();
    bool any = false;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        any = true;
        char buf[128];
        Esp32BaseWeb::sendChunk("<div class='ir-field'><label>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</label><div class='ir-input-unit'>");
        char key[8];
        snprintf(key, sizeof(key), "z%u", zone.id);
        sendNumberInput(key, plan.zoneDurationSec[i] / 60UL, 0, maxMinutes);
        Esp32BaseWeb::sendChunk("<span class='ir-unit'>分钟</span></div></div>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<div class='ir-empty'>还没有启用水路，计划保存后也不会执行有效浇水步骤。</div>");
    }
    Esp32BaseWeb::sendChunk("</div></div>");
}

void sendPlanEditForm(const WateringPlan& plan, const char* action, bool isCreate) {
    Esp32BaseWeb::sendChunk("<form class='ir-form' method='post' action='");
    Esp32BaseWeb::sendChunk(action);
    Esp32BaseWeb::sendChunk("'>");
    if (!isCreate) {
        char id[64];
        snprintf(id, sizeof(id), "<input type='hidden' name='id' value='%u'>", plan.id);
        Esp32BaseWeb::sendChunk(id);
    }

    Esp32BaseWeb::sendChunk("<div class='ir-setting-list'>");
    sendSettingToggle("启用计划", "启用后按每日启动时间自动执行，也可以在运行页立即执行。", "enabled", plan.enabled);
    Esp32BaseWeb::sendChunk("<div class='ir-setting'><div><span class='ir-setting-title'>计划名称</span><span class='ir-setting-desc'>用于区分不同季节、上午/下午或不同浇水策略。</span></div><div class='ir-control'>");
    sendTextInput("name", plan.name, sizeof(plan.name) - 1);
    Esp32BaseWeb::sendChunk("</div></div><div class='ir-setting'><div><span class='ir-setting-title'>重复方式</span><span class='ir-setting-desc'>当前产品只支持每日计划，不做复杂重复策略。</span></div><div class='ir-control'><span class='ir-pill on'>每日</span></div></div></div>");
    sendPlanStartFields(plan);
    sendPlanZoneDurationFields(plan);
    Esp32BaseWeb::sendChunk("<div class='actions'>");
    Esp32BaseWeb::sendChunk("<a class='btnlink secondary' href='/irrigation/plans'>返回列表</a>");
    Esp32BaseWeb::sendChunk(isCreate ? "<input type='submit' value='创建计划'>" : "<input type='submit' value='保存计划'>");
    Esp32BaseWeb::sendChunk("</div></form>");
}

void handlePlansPage() {
    Esp32BaseWeb::sendHeader("计划");
    Esp32BaseWeb::sendPageTitle("计划", "每日计划，最多 8 个计划，每个计划最多 4 个启动时间");

